Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: བདག་ནི་ཁྱོད་ལ་བསྲུང་ཞིང་སྐྱོང་བ་ལགས་སོ། །
en: I shall protect and take care of you.’

source: དེས་བུ་སྟོང་ཡང་དེའི་བསྲུངས་མར་བཀོད་ལ། ཐོགས་པ་མེད་པའི་སེམས་ཀྱིས་སྲོག་ཆགས་སུམ་ཁྲི་ཞིག་ཀྱང་བདེ་བའི་ཡོ་བྱད་ཐམས་ཅད་སྦྱོར་དུ་བཅུག་གོ། །
en: “The monarch arranged for one thousand of his sons to be the teacher’s guards, and with his boundless attitude he arranged for thirty thousand people to provide pleasant living conditions.

source: ཆོས་སྨྲ་བ་བདེ་བར་གནས་པར་བྱས་པ་དེས་ཀྱང་བསྐལ་པ་ཕྱེད་ཀྱི་བར་དུ་ཏིང་ངེ་འཛིན་འདི་བསྟན་ཏེ།
en: Thus, living comfortably, the teacher taught this absorption for half an eon.

source: དགེ་བའི་རྩ་བ་དེ་བྱས་པས་ཆོས་སྨྲ་བ་དང་། རྒྱལ་པོ་བུ་དང་བཅས་ཤིང་སྐྱེ་བོའི་འཁོར་དང་བཅས་པ་དང་། ཚོགས་པ་ཐམས་ཅད་ཀྱིས་བསྐལ་པ་བརྒྱད་ཅུར་སངས་རྒྱས་གཏམས་པ་བྱེ་བ་སུམ་ཁྲི་མཉེས་པར་བྱས་ཏེ
en: Due to the roots of virtue resulting from this, the Dharma teacher, the king, his sons, and all the other people involved came together to please three billion buddhas over a period of eighty eons,

source: ཐམས་ཅད་ལས་ཏིང་ངེ་འཛིན་འདི་ཐོབ་བོ། །
en: and they received this absorption from each of them.

source: བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་སངས་རྒྱས་ཀྱི་ཞིང་ཡང་ཡོངས་སུ་འཛིན་པར་གྱུར་ཏོ། །
en: In accordance with their wishes, they also took up residence in buddha realms.

source: མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོ་དེའི་ཚེ་ན་ཆོས་སྨྲ་བ་དེ་གལ་ཏེ་ཁྱོད་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་སེམས་ན་དེ་དེ་ལྟར་མི་བལྟ་སྟེ།
en: Prāmodyarāja, you may believe that teacher was someone else, but you should not think so.

source: དེ་བཞིན་གཤེགས་པ་ཚེ་དཔག་མེད་ནི་ཆོས་སྨྲ་བར་དེར་གྱུར་ཏོ། །
en: He was none other than the thus-gone Amitāyus.

source: དེ་བཞིན་གཤེགས་པ་མི་འཁྲུགས་པ་ནི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་གྱུར་ཏོ། །
en: The universal monarch was the thus-gone Akṣobhya,

source: བསྐལ་པ་བཟང་པོ་པའི་སངས་རྒྱས་སྟོང་ནི་རྒྱལ་པོའི་བུ་རྣམས་སུ་གྱུར་ཏོ། །
en: and the one thousand princes are the thousand buddhas of the Good Eon.

source: མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོ་ལ་སོགས་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སུམ་ཁྲི་པོ་འདི་དག་ནི་འདི་ལྟར་ཆོས་སྨྲ་བ་དེའི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་བདེ་བར་སྦྱོར་བ་དང་། བསྲུང་ཞིང་སྐྱོང་བར་གྱུར་ཏོ། །
en: And, Prāmodyarāja, all the other thirty thousand bodhisattvas were the beings who provided for, protected, and sustained the Dharma teacher in accordance with his wishes.

source: མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཏིང་ངེ་འཛིན་ཡིན་ཏེ།
en: “Prāmodyarāja, since this is the absorption of the bodhisattvas,

source: དེ་ལྟ་བས་ན་ཡང་དག་པར་བསྒྲུབ་པར་གནས་པས་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་འདི་ནི་གུས་པ་དང་བཅས་པར་ཟུང་ཤིག །
en: you must genuinely accomplish it. You must respectfully uphold this absorption of the bodhisattvas.

source: ལྷོགས་ཤིག །བྲི་བར་གྱིས་ཤིག །སྟོན་ཅིག །
en: You must gather it, write it down, and teach it.”

source: གང་གིས་བསྐལ་པ་བྱེ་བ་སྟོང་ཚང་བར། །སེམས་ཅན་ཀུན་ལ་བདེ་བ་བྱིན་པ་བས། །
en: “Were one to bring happiness to all sentient beings Throughout ten billion eons,

source: ལ་ལས་བྱང་ཆུབ་མཆོག་སེམས་གཅིག་བསྐྱེད་པ། །དེ་ཡི་བསོད་ནམས་དཔེར་ཡང་བཟོད་མི་འགྱུར། །
en: The merit of doing so would not withstand comparison To but a single instance of cultivating the mind of awakening.

source: ཕྱོགས་བཅུ་དག་ན་སེམས་ཅན་ཇི་སྙེད་པ། །དེ་དག་ཐམས་ཅད་རང་རྒྱལ་གྱུར་དེ་ལ། །
en: “Even if all sentient beings in the ten directions Were solitary buddhas

source: བདེ་བ་ཀུན་གྱིས་བསྐལ་པར་བཀུར་བྱས་ཀྱང་། །
en: And one were to venerate them with all manner of pleasures for an eon,

source: འདི་ལྟར་བྱང་ཆུབ་མཆོག་ཙམ་བསོད་ནམས་མེད། །
en: The merit would be no match for that of supreme awakening.

source: འཇིག་རྟེན་སེམས་ཅན་ཀུན་སངས་རྒྱས་གྱུར་ཏེ། །
en: “Even if all sentient beings in the world were buddhas

source: དེ་དག་བསམ་པ་ཇི་བཞིན་བསྐལ་མཆོད་པས། །ལ་ལས་བྱང་ཆུབ་མཆོག་སེམས་གཅིག་བསྐྱེད་པ། །
en: And one were to worship them according to their wishes for an eon,

source: དེ་ཡི་བསོད་ནམས་དཔེར་ཡང་བཟོད་མི་འགྱུར། །
en: The merit of doing so would not withstand comparison

source: གང་གིས་སངས་རྒྱས་ཆོས་རྣམས་བསྲུང་བའི་ཕྱིར། །
en: To but a single instance of cultivating the mind of awakening.

source: ཚིག་བཞིའི་ཚིགས་བཅད་མི་ཡིས་གུས་བྱེད་པས། །ལ་ལས་བྱང་ཆུབ་ཡོངས་སུ་བསྲུང་བའི་ཕྱིར། །
en: “The merit of someone who venerates a four-lined stanza In order to protect the teachings of the Buddha

source: བྱང་ཆུབ་སེམས་ཀྱི་བསོད་ནམས་དེ་འདྲ་མེད། །འཇིག་རྟེན་ཁམས་འདིའི་སེམས་ཅན་གང་སུ་དག །དེ་དག་ཐམས་ཅད་བྱང་ཆུབ་བཀོད་པ་བས། །
en: Is not like that of someone who gives rise to the mind of awakening In order to protect awakening. “The merit of establishing all beings of this world In great awakening

source: ལ་ལས་ཕུང་པོ་མེད་པའི་ཚིག་མཉན་ནས། །སྐྲག་མེད་དེ་ཡི་བསོད་ནམས་ཁྱད་པར་འཕགས། །
en: Is surpassed by the one who listens without fear When it is said that the aggregates do not exist.

source: གང་གཱའི་ཀླུང་ཕྲག་བྱེ་བ་བྱེ་སྙེད་ཀྱི། །བསྐལ་པར་བྱང་ཆུབ་སེམས་དཔས་རིན་པོ་ཆེའི། །འབྱོར་པ་ཀུན་གྱིས་ཞིང་བཀང་སྦྱིན་བྱིན་པས། །
en: “The merit of the bodhisattva who fills all realms With gifts of precious wealth For as many eons as there are sand grains in the Gaṅgā

source: ལ་ལས་བྱང་ཆུབ་བསྲུངས་འདི་ཁྱད་པར་འཕགས། །
en: Is outshone by the one who protects awakening.

source: རྒྱལ་བས་གནང་བའི་བྱང་ཆུབ་བསྲུང་བྱ་བ། །བསམ་གྱིས་མི་ཁྱབ་པ་ཡི་ཏིང་འཛིན་འདི། །གང་ཞིག་ཚིག་བཞིའི་ཚིགས་བཅད་བསྲུང་བ་དེའི། །
en: “The merit of one four-lined stanza Of this protection of awakening granted by the victorious ones— This inconceivable treasure of absorption—

source: ཚིག་ཀུན་གྱིས་ནི་བརྗོད་པར་མི་ནུས་སོ། །
en: Cannot be put into words.

source: གང་ཞིག་ཏིང་འཛིན་འདི་བྲིས་འཆང་བྱེད་པ། །
en: “Those who write down and maintain this absorption

source: དུས་བྱེད་ཚེ་ན་སངས་རྒྱས་ཕལ་ཆེན་མཐོང་། །
en: Will at the time of their passing behold great assemblies of buddhas.

source: དེ་ནི་དྲན་ལྡན་གཞར་ཡང་རྨོངས་པ་མེད། །
en: Mindful and never obscured,

source: གང་དུ་འདོད་པ་དེར་ནི་སྐྱེ་བ་ལེན། །
en: They will take birth wherever they wish.

source: ཏིང་འཛིན་རྒྱལ་པོ་ལ་ནི་དགའ་བྱེད་པ། །བྱང་ཆུབ་མ་ཐོབ་བར་དུ་ལུས་བདེ་ཞིང་། །
en: “Those who delight in this king of absorption Will enjoy physical pleasure until the attainment of awakening.

source: དེ་བཞིན་སེམས་བདེ་མཐོ་རིས་སུ་ཡང་འགྲོ། །
en: They will have happiness of mind and proceed to the higher realms.

source: འཕགས་དང་ཕྲད་ཅིང་སྡུག་བསྔལ་གཞར་མི་མྱོང་། །
en: They will meet noble beings and never experience suffering.

source: རྒྱལ་བ་རྣམས་ཀྱི་མཛོད་ཡིན་འོད་མཐའ་ཡས། །སྒོ་མོ་སྟོང་ཕྲག་ཁྲི་ལ་འཇུག་པ་དག །སྟོབས་མཆོག་གནས་ཏེ་ང་ཡིས་བསྟན་པར་བྱས། །
en: “Here I have taught the treasury of the victorious ones, The application of ten thousand gateways of infinite light, The abode of supreme power—

source: ཏིང་འཛིན་བྱང་ཆུབ་འདི་ལ་སྦྱོར་བར་གྱིས། །
en: Therefore, practice this absorption of awakening.

source: ངས་ནི་ཚིག་གིས་བརྗོད་ནུས་དེ་སྙེད་དོ། །
en: “This is as much as I can say in words,

source: ཁྱོད་ཀྱིས་བྱ་བ་དག་ནི་འདི་ཡིན་ཏེ། །
en: And this is what you must pursue in action.

source: ཇི་སྲིད་བར་དུ་དེར་འཇུག་སྦྱོར་གྱིས་དང་། །
en: Apply yourselves constantly to this practice,

source: ཕྱི་མའི་དུས་ན་གདུངས་པར་མི་འགྱུར་རོ། །
en: And you will not suffer later.

source: ཇི་ལྟར་ལག་ཏུ་འོངས་བཞིན་ངས་བཤད་དེ། །
en: “Take my explanation, as if placed in your hand,

source: ལྷག་པའི་བསམ་པས་སྤྱོད་པ་སྦྱོར་གྱིས་ཤིག །
en: And employ it in practice with superior intent.

source: བྱམས་པས་བྱ་བ་མང་པོ་ངས་བྱས་པས། །
en: I have performed many loving deeds,

source: ཕ་ཡིས་བུ་ལ་གདམས་པ་བཞིན་དུ་བྱ། །
en: So treat this as a father’s guidance to his child.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཏིང་ངེ་འཛིན་འདི་བསྟན་ནས་ཏིང་ངེ་འཛིན་འདི་ལ་སྙོམས་པར་ཞུགས་སོ། །
en: When the Blessed One had taught this absorption, he entered it.

source: བྱང་ཆུབ་སེམས་དཔའ་མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོ་ཡང་སྙོམས་པར་ཞུགས་ཏེ་ཏིང་ངེ་འཛིན་འདི་ཞག་བདུན་དུ་ཆོས་རབ་ཏུ་རྣམ་པར་འབྱེད་པས་རབ་ཏུ་རྣམ་པར་འབྱེད་དོ། །
en: Likewise, the bodhisattva Prāmodyarāja entered equipoise, and for a period of seven days he discerned the phenomena associated with this absorption by means of careful investigation.

source: དེ་ནས་ཡངས་པ་ཅན་གྱི་ནང་རོལ་ན་ལིཙྪ་བཱི་བརྒྱད་ཁྲི་བཞི་སྟོང་དང་ཡངས་པ་ཅན་གྱི་ཕྱི་རོལ་ན་ལིཙྪ་བཱི་བརྒྱད་ཁྲི་བཞི་སྟོང་འཁོད་པ་དག་འདི་སྙམ་དུ་སེམས་པར་གྱུར་ཏེ
en: Then eighty-four thousand Licchavis who were gathered inside Vaiśālī and another eighty-four thousand Licchavis who had assembled outside Vaiśālī thought to themselves,

source: སྐྱེ་བོ་མང་པོ་ལ་ཕན་པའི་ཕྱིར་དང་།
en: “In order to benefit many beings,

source: སྐྱེ་བོ་མང་པོ་ལ་བདེ་བའི་ཕྱིར་དང་།
en: in order bring happiness to many beings,

source: འཇིག་རྟེན་ལ་ཐུགས་བརྩེ་བའི་ཕྱིར་དང་།
en: and out of love for the world,

source: ལྷ་དང་མི་རྣམས་ལ་ཕན་པ་དང་། བདེ་བའི་དོན་དུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཇིག་རྟེན་དུ་བྱུང་སྟེ
en: the thus-gone, worthy, complete and perfect Buddha has appeared in the world in order to help gods and humans and bring them happiness.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་ནང་དུ་ཡང་དག་འཇོག་ལ་ཞུགས་པ་དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་ལས་བཞེངས་པར་བདག་ཅག་གི་ནང་ནས་སུས་གསོལ་བ་གདབ་སྙམ་མོ། །
en: But now the thus-gone, worthy, complete and perfect Buddha has entered meditative seclusion. Who among us should now request that he rise from the absorption of the thus-gone ones?”

source: དེ་ནས་ནང་རོལ་ན་འཁོད་པའི་ལིཙྪ་བཱི་རྣམས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ག་ལ་བ་དེར་དོང་སྟེ་ཕྱིན་ནས། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: The Licchavis who were assembled inside Vaiśālī went before the venerable Śāriputra and said,

source: བཙུན་པ་ཤཱ་རིའི་བུ་ཚེ་ཐུང་བའི་དུས་ན་སངས་རྒྱས་འབྱུང་བ་ཡང་དཀོན་ལ། དད་པ་ཡང་དཀོན་པས།
en: “Venerable Śāriputra, at the time when the lifespan is short, the appearance of a buddha is rare, and faith is also rare.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མཉམ་པར་བཞག་པ་དེ་བདག་ཅག་ལ་ཐུགས་བརྩེ་བའི་སླད་དུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་ཏིང་ངེ་འཛིན་དེ་ལས་ལེགས་པར་བཞེངས་སུ་གསོལ་ཅིག །
en: Now the thus-gone, worthy, complete and perfect Buddha has entered equipoise. Please request the thus-gone, worthy, complete and perfect Buddha to consider us with a loving heart and to kindly reemerge from his meditative absorption.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་ལིཙྪ་བཱི་དེ་དག་ལས་ཚིག་དེ་ཐོས་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ།
en: Upon hearing those words, the venerable Śāriputra went to the place where the Blessed One was residing.

source: བཅོམ་ལྡན་འདས་བསམ་གཏན་གྱིས་བསམ་གཏན་དུ་ཞུགས་ཤིང་། ཏིང་ངེ་འཛིན་གྱིས་ཏིང་ངེ་འཛིན་དུ་ཞུགས་པ་དག་བཙལ་ཡོངས་སུ་བཙལ་ཀྱང་དེ་བཞིན་གཤེགས་པའི་གནས་པ་མངོན་པར་མ་རྟོགས་སོ། །
en: Yet, although Śāriputra searched for the Blessed One’s dwelling by entering meditative concentration and absorption, he could not discover the abode of the Thus-Gone One.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་གནས་བརྟན་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ག་ལ་བ་དེར་སོང་སྟེ།
en: The venerable Śāriputra then went to see the venerable Mahā­maudgalyāyana,

source: ལིཙྪ་བཱི་རྣམས་ཀྱི་བསམ་པ་དང་རང་བཞིན་དེ་ཉིད་སྨྲས་སོ། །
en: explaining to him about the intents and wishes of the Licchavis.

source: དེ་ནས་མཽད་གལ་གྱི་བུ་ཆེན་པོ་རྫུ་འཕྲུལ་གྱི་མཐུས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་རྣམས་གཡོས་རབ་ཏུ་གཡོས།
en: In response, the venerable Mahā­maudgalyāyana applied his miraculous abilities, thus causing the entire trichiliocosm to tremble and shake,

source: ཀུན་ཏུ་རབ་ཏུ་གཡོས་ནས་དེ་བཞིན་གཤེགས་པ་ཏིང་ངེ་འཛིན་ལས་བཞེངས་པར་གསོལ་བའི་ཕྱིར་ཚངས་པའི་འཇིག་རྟེན་མན་ཆད་དབྱངས་ཀྱིས་གོ་བར་བྱས་ཀྱང་མ་བཞེངས་སོ། །
en: and his voice reverberated through the whole world below the Realm of Brahmā, requesting the Thus-Gone One to reemerge from absorption. Yet the Blessed One did not emerge.

source: དེ་བཞིན་དུ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་དང་། ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་དང་། ཀུན་ཤེས་ཀཽཎྜི་ནྱ་དང་། ཚེ་དང་ལྡན་པ་བཟང་པོ་དང་། ལག་བཟངས་དང་། མིང་ཆེན་དང་། བ་ལང་བདག་དང་། སྒྲ་གཅན་འཛིན་དང་། གང་པོ་དང་། རབ་འབྱོར་དང་། ཀཱ་ཏྱཱའི་བུ་དང་། འོད་སྲུང་དང་། ཀུན་དགའ་བོ་དང་། གང་པོ་ངན་དང་། ཀ་པི་ན་ཆེན་པོ་དང་། ཉེ་བར་འཁོར་དང་། བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ལྔ་སྟོང་དང་ལྷན་ཅིག་ཏུ་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་ལྷགས་ཏེ།
en: At that time the venerable Śāriputra, the venerable Mahā­maudgalyāyana, Ājñāta­kauṇḍinya, Bhadra, Subāhu, Mahānāma, Gavāmpati, Rāhula, Pūrṇa, Subhūti, Kātyāyana, Kāśyapa, Ānanda, Pūrṇāvara, Mahākapphiṇa, Upāli, and the bodhisattva Maitreya, along with five thousand other bodhisattvas, proceeded to the place where the Blessed One resided.

source: བཅོམ་ལྡན་འདས་ལ་འཁོར་བར་བསྐོར་ནས་རང་རང་གི་སྟན་ལ་འཁོད་དོ། །
en: Encircling the Blessed One, they took their seats.

source: རྒྱལ་པོ་ཆེན་པོ་བཞི་རྣམས་དང་། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་། ཤིན་ཏུ་འཐབ་བྲལ་དང་། དགའ་ལྡན་དང་། འཕྲུལ་དགའ་དང་། གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷའི་བུ་རྣམས་ཀྱང་འདོད་པ་ན་སྤྱོད་པའི་ལྷའི་བུ་དཔག་ཏུ་མེད་པ་དག་དང་ལྷན་ཅིག་ཏུ་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་
en: The Four Great Kings, Śakra who rules the gods, and innumerable gods of the desire realm arriving from the Heaven Free from Strife, the Heaven of Joy, the Heaven of Delighting in Emanations, and the Heaven of Making Use of Others’ Emanations likewise reached where the Blessed One resided.

source: ལྷགས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ཉིད་ལ་འདུད་ཅིང་ཕྱོགས་གཅིག་ཏུ་འཁོད་པར་གྱུར་ཏོ། །
en: They bowed their heads before the Blessed One’s feet and then stood to one side.

source: ཚངས་པ་དང་། འོད་གསལ་དང་། དགེ་རྒྱས་དང་། འབྲས་བུ་ཆེ་བ་ནས་གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བར་དུ་དེ་བཞིན་དུ་སྦྱར་ཏེ། ལྷའི་བུ་དཔག་ཏུ་མེད་པ་དག་དང་ལྷན་ཅིག་ཏུ་བཅོམ་ལྡན་འདས་ཉིད་ལ་འདུད་ཅིང་ཕྱོགས་གཅིག་ཏུ་འཁོད་པར་གྱུར་ཏོ། །
en: Likewise, from the heavens of Brahmā, Luminosity, Perfected Virtue, Great Fruition, and all the way up to the pure abodes, innumerable gods arrived. They all paid respect to the Blessed One and took their places.

source: དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོ་དེ་ཞག་བདུན་དུ་ཡིད་ལ་གཞན་མི་བྱེད་པར་ནང་དུ་ཡང་དག་འཇོག་ལ་ཞུགས་པར་གྱུར་ཏོ། །
en: By then the bodhisattva Prāmodyarāja had dwelt undistractedly in meditative seclusion for seven days.

source: དེས་ཞག་བདུན་འདས་པ་དང་བསམས་དཔྱད་དེ། ནང་དུ་ཡང་དག་འཇོག་ལས་ལངས་ནས།
en: When that period of seven days had passed, he began to discern and arose from meditative seclusion.

source: བྱང་ཆུབ་སེམས་དཔའ་ཡོན་ཏན་ལ་དབང་དུ་གྱུར་པ་དག་དང་། འཁོར་གྱི་ཁྱམས་ག་ལ་བ་དེར་དོང་སྟེ་ལྷགས་ནས་ཕྱག་བཙལ་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཐལ་མོ་སྦྱར་ནས་སྟན་ལ་འཁོད་པར་གྱུར་ཏོ། །
en: Arriving at the courtyard where the Blessed One resided, he entered among the masterful bodhisattvas, bowed down, and then took his seat with his palms joined, facing the Blessed One.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཏིང་ངེ་འཛིན་དེ་ལས་མཁྱེན་བཞིན་དུ་བཞེངས་ཏེ་
en: Fully aware, the Blessed One now reemerged from his absorption.

source: ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་ལ་གླང་པོ་ཆེའི་ལྟ་སྟངས་ཀྱིས་གཟིགས་ནས་ཅང་མི་གསུང་བར་བཞུགས་པར་གྱུར་ཏོ། །
en: With the gaze of an elephant, he silently gazed upon the whole gathering.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: The bodhisattva Prāmodyarāja at that point made this request to the Blessed One:

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཆོས་ཀྱི་བཀའ་མཆིད་འབེལ་བ་བཀའ་སྩལ་བའི་དུས་ལ་བབ་སྟེ།
en: “It is time for the Blessed One to deliver a Dharma discourse.

source: དེ་ལྟ་ལགས་པས། གལ་ཏེ་ཞུས་ནས་ཞུ་བ་ལུང་བསྟན་པའི་སླད་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ལ་སྐབས་ཕྱེ་ན། བཅོམ་ལྡན་འདས་ལ་བདག་ཕྱོགས་འགའ་ཞིག་ཞུའོ། །
en: If the Blessed One will grant me the occasion, I would like to request that certain matters be explained.”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One then said to the bodhisattva, Prāmodyarāja,

source: རིགས་ཀྱི་བུ་ཁྱོད་ཅི་དང་ཅི་འདོད་པ་དེ་བཞིན་གཤེགས་པ་ལ་ཞུས་ཤིག་དང་ངས་ཞུ་བ་ཞུས་པ་དེ་དང་དེ་ལུང་བསྟན་པས་ཁྱོད་ཀྱི་སེམས་རངས་པར་བྱའོ། །
en: “Noble son, you may ask the Thus-Gone One whatever you wish. I shall respond to all your questions. I shall satisfy you in this way.”

source: དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: The bodhisattva Prāmodyarāja now made the following request to the Blessed One:

source: བཅོམ་ལྡན་འདས་འདི་ན་བདག་གཅིག་པུ་དབེན་པར་ཞུགས་ཏེ། ནང་དུ་ཡང་དག་འཇོག་ལ་ཞུགས་པ་ན་འདི་སྙམ་དུ་གང་དག་བྱང་ཆུབ་སེམས་དཔའ་འདི་དག་བྱང་ཆུབ་ཀྱི་དོན་དུ་ཡང་དག་པར་འགྲུབ་པར་འགྱུར་བ་དང་། དེ་དག་བྱང་ཆུབ་ཀྱི་དོན་དུ་ཕ་རོལ་ཏུ་ཕྱིན་པ་དག་གིས་དགེ་བའི་རྩ་བ་སོགས་པར་འགྱུར་རོ་སྙམ་བགྱིད་ན།
en: “Blessed One, while I resided alone in the forest in meditative seclusion, I thought, ‘These bodhisattvas gain true accomplishment for the sake of awakening. By means of the perfections they accumulate roots of virtue for the sake of awakening.’

source: བཅོམ་ལྡན་འདས་དེ་ལ་ཕ་རོལ་ཏུ་ཕྱིན་པ་སེམས་ཅན་རྣམས་ལ་ཕན་འདོགས་པ་ཞིག་གམ། ཕ་རོལ་ཏུ་ཕྱིན་པ་བྱང་ཆུབ་ལ་ཕན་འདོགས་པ་ཞིག་གམ།
en: But I wonder, Blessed One, do the perfections benefit sentient beings or are they beneficial for awakening—

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་ཟག་པ་དང་བཅས་པ་ཞིག་གམ།
en: are the perfections defiled or are they undefiled?

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་ཟག་པ་མེད་པ་ཞིག་གམ་ཞེས་དེ་ལྟར་བརྟགས་ཏེ་ཅི་ནས་ཀྱང་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་དག་པར་འཕེལ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཆོས་ཀྱི་ཚུལ་ཐོག་མ་དང་། བར་མ་དང་། ཐ་མའི་བར་དུ་ལེགས་པར་གཟུང་བ་བསྐྱེད་པ་དང་། ཐབས་ལ་མཁས་པའི་སྤྱོད་པ་དེ་དག་མཆོག་ཏུ་དགའ་བ་ཆེས་མང་པོ་རབ་ཏུ་ཐོབ་པར་བགྱི་བའི་སླད་དུ། བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱ་ཆེར་བཀའ་སྩལ་དུ་གསོལ།
en: I request the Blessed One to please explain these matters at length so that the perfections may develop in the bodhisattvas; so that the Dharma ways of the bodhisattvas may be engendered and upheld in the beginning, middle, and end; and so that such skillful practices may become the source of abundant, supreme joy.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོ་ལེགས་སོ་ལེགས་སོ། །
en: The Blessed One replied, “Excellent, excellent, Prāmodyarāja!

source: མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོ་ཁྱོད་གང་གི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ལ་དོན་འདི་ཉིད་དྲི་བར་སེམས་པ་ཁྱོད་ལེགས་སོ། །
en: It is very good that you wish to question the Thus-Gone One about these matters, Prāmodyarāja.

source: དེ་ལྟ་མོད་ཀྱི་ཁྱོད་ཀྱིས་འདས་པའི་སངས་རྒྱས་བྱེ་བ་ཕྲག་དགུ་བཅུ་དག་ལས་ཀྱང་ཞུ་བ་འདི་ཉིད་ཞུས་སོ། །
en: Indeed, you have posed this question to nine hundred million buddhas in the past.

source: མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོ་དེའི་ཕྱིར་ཤིན་ཏུ་ལེགས་པར་ཉོན་ལ་ཚུལ་བཞིན་དུ་ཡིད་ལ་ཟུང་ཤིག་དང་ངས་བཤད་དོ། །
en: Therefore, Prāmodyarāja, listen very well and keep my words correctly in mind;

source: བཅོམ་ལྡན་འདས་དེ་ལྟར་འཚལ་ལོ། །
en: I shall explain it to you.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: “Blessed One, I shall do just as you say.” Addressing the bodhisattva Prāmodyarāja, the Blessed One then continued:

source: མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོ་ཡོངས་སུ་སྦྱོང་བར་བྱེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: “Prāmodyarāja, there are six purifying perfections.

source: སྣང་བར་བྱེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six illuminating perfections.

source: འཇིག་རྟེན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six mundane perfections.

source: སེམས་ཅན་ལ་དམིགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections focused on sentient beings.

source: གནས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six abiding perfections.

source: འཁོར་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections for saṃsāra.

source: ཀུན་ནས་ཉོན་མོངས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of defilement.

source: གཞན་ལ་ཕན་འདོགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of benefiting others.

source: གནས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections having supports.

source: བྱང་ཆུབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of awakening.

source: ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of wisdom.

source: བདག་ལ་ཕན་འདོགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections that benefit oneself.

source: འཐོབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of attainment.

source: རེ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of hope.

source: རྣམ་པ་གསུམ་ལྟ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of the threefold view.

source: ལས་བྱེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections with respect to the performance of action.

source: ལམ་ཤིན་ཏུ་སྦྱངས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of purification via the path.

source: བརྩོན་པ་མི་འདོར་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of untiring endeavor.

source: རིགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of reasoning.

source: བྱ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: “There are six perfections based on what should be done.

source: བྱ་བ་མ་ཡིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections based on what should not be done.

source: རློམ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections based on conceit.

source: བརྩམས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of application.

source: དགེ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of virtue.

source: རྣོ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of sharpness.

source: ཟབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of profundity.

source: སྣ་ཚོགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of variety.

source: བཀོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of displaying.

source: ཐུབ་པ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of being unconquerable.

source: ཆོས་ལ་དམིགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections focused on phenomena.

source: ཞི་གནས་ལ་དམིགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections focused on calm abiding.

source: ལྷག་མཐོང་ལ་དམིགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections focused on special insight.

source: ཐམས་ཅད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of universality.

source: ཕྱོགས་གཅིག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of partiality.

source: ཉམས་པ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six incorruptible perfections.

source: བཅོས་མ་མ་ཡིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six uncontrived perfections.

source: དབུལ་པོ་མ་ཡིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections for freedom from poverty.

source: ཕྱིར་མི་ལྡོག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six irreversible perfections.

source: རྣམ་པར་བསྒྲུབས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of accomplishment.

source: དག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of purity.

source: བརྟན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of stability.

source: བརྟུན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of exertion.

source: ངོམས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of satisfaction.

source: འཇིག་རྟེན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six mundane perfections.

source: འཇིག་རྟེན་ལས་འདས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six transmundane perfections.

source: བླ་ན་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six unsurpassable perfections.

source: གཡེང་བ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections free from distraction.

source: མི་འཁོར་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of not cycling in saṃsāra.

source: ཐུན་མོང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six shared perfections.

source: ཐུན་མོང་མ་ཡིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six unshared perfections.

source: རྣམ་པར་འགེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of sharing.

source: རྣམ་པར་སྨིན་པ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections without ripening.

source: ངོ་བོ་ཉིད་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections pertaining to essence.

source: དངོས་པོ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of nonentity.
